//Какое будет выведено значение: let x = 5; alert( x++ ); ?
5
//Чему равно такое выражение: [ ] + false - null + true ?
пустой массив при конкатенации отображается как пустая строка поэтому
 [] + false будет тип данных строка ( выведет false)
 В итоге выведет NaN т.к. это математическая операция 
//Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
2 т.к. это последовательное присваивание
//Чему равна сумма [ ] + 1 + 2?
12 (т.к. пустой массив конкатенирузется в пустую строку)
//Что выведет этот код: alert("1"[0])?
1 т.к. к строке можно обращаться через индекс
//Чему равно 2 && 1 && null && 0 && undefined ?
null
//Есть ли разница между выражениями? !!( a && b ) и (a && b)?
есть
//Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
3
//a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
нет
//Что выведет этот код: alert( +Infinity ); ?
Infinity
//Верно ли сравнение: Ёжик  > яблоко?
нет
//Чему равно 0 || "" || 2 || undefined || true || falsе ?
2



